BO/lib/itaPHPJiride/InviaMail_esempio.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tem="http://tempuri.org/"> 
    <soapenv:Header/> 
    <soapenv:Body> 
        <tem:InviaMail> 
            <tem:strXML><![CDATA[ <messaggioIn> <annoProt>2014</annoProt> <numProt>32</numProt> <docId></docId> <oggettoMail>Test: wspostaweb</oggettoMail> <testoMail>Ciao</testoMail> <mittenteMail>daniele.sampaoli@maggioli.it</mittenteMail> <destinatariMail> </destinatariMail> <destinatariCCMail> <destinatarioCCMail></destinatarioCCMail> </destinatariCCMail> <utente></utente> <ruolo></ruolo> <invioInteroperabile>S</invioInteroperabile> </messaggioIn> ]]></tem:strXML> 
            <tem:CodiceAmministrazione>!ingres/ingres@sicraweb_test/sicraweb_test</tem:CodiceAmministrazione> 
            <tem:CodiceAOO>A123--s</tem:CodiceAOO> 
        </tem:InviaMail> 
    </soapenv:Body> 
</soapenv:Envelope>